{
  "domain": "indiandistricts.in",
  "startUrl": "https://indiandistricts.in/cultures/maharashtra/pune/architecture/",
  "crawledAt": "2025-11-12T04:41:03.836Z",
  "pages": [
    {
      "url": "https://indiandistricts.in/cultures/maharashtra/pune/architecture/",
      "title": "Architecture - Pune",
      "description": "Explore Architecture in Pune district.",
      "content": "Home Maharashtra Pune Architecture Pune Ahilyanagar Akola Amravati Beed Bhandara Buldhana Chandrapur Chh. Sambhaji Nagar Dharashiv Dhule Gadchiroli Gondia Hingoli Jalgaon Jalna Kolhapur Latur Mumbai Mumbai Suburban Nagpur Nanded Nandurbar Nashik Palghar Parbhani Pune Raigad Ratnagiri Sangli Satara Sindhudurg Solapur Thane Wardha Washim Yavatmal Architecture Introduction Architecture Artforms Cultural Sites Festivals & Fairs Food History Language Markets Sports & Games Stories Agriculture Demography Education Elections Environment Health Industry Labor Livestock & Fisheries Police & Judiciary Revenue & Expenditure Transport & Communication Suggest Edits Suggest Edits Contents Architecture of Prominent Sites Bhimashankar Mandir Shaniwar Wada Parvati Hill Complex St. Paul’s Church College of Engineering, Pune Fergusson College Mahatma Phule Mandai Aga Khan Palace Bank of Maharashtra Building Residential Architecture Residences from the 1860s on the Rajwada Road in Bhor Village Bhausaheb Rangari Wada in Budhwar Peth A Residence from the mid-20th Century in Velhe A Residence from the late 20th Century in Velhe A Residential Building from 2000s in Bibwewadi A Residential Building from 2010s in Dhankawadi A Residential Township from the early 21st Century in Hinjewadi Sources PUNE Architecture Last updated on 6 November 2025. Help us improve the information on this page by clicking on suggest edits or writing to us. Architecture of Prominent Sites From early medieval mandirs like Bhimashankar Mandir, which showcases Nagara and Maratha architectural styles, to Peshwa-era wadas and vibrant peths, Pune's architecture reflects a layered coexistence of dynastic and imperial influences. The arrival of the British introduced new typologies, such as military barracks, Gothic churches, and civic buildings like the Mahatma Phule Mandai. Post-independence, the city saw the emergence of Art Deco and modernist forms, especially in institutional and residential buildings. These shifts reveal not just stylistic changes but the evolving social fabric and aspirations of a growing urban centre. Bhimashankar Mandir The Bhimashankar Mandir, located in the Khed taluka of Pune district, is a notable example of the Nagara style of Mandir architecture, a tradition rooted in northern India and adapted in the Deccan over centuries. Though the exact date of its original construction is uncertain, literary and inscriptional sources suggest the Mandir dates back to the early 13th century. Over the centuries, it has seen several additions and renovations, particularly under the patronage of Maratha leaders such as Chimaji Antaji Nayik Bhinde and Nana Phadnavis. The Mandir is one of the twelve Jyotirlinga devasthans of Bhagwan Shiv in India. Architecturally, Bhimashankar Mandir preserves an archaic Nagara form rarely found in the Deccan, with subtle influences from the Hemadpanthi style visible in the stone masonry and structural techniques. Built primarily from stone, the Mandir reflects an older form of the Nagara tradition, evident in its simple yet elegant proportions and simple ornamentation. The Mandir is best known for its shikhara (spire), rising above the garbhagriha (sanctum), crowned by an amalaka and kalasha, both hallmark features of the Nagara style. Elements such as devakoshtas, dome-shaped roofs, and traces of lime-sand sculptures further reflect the Mandir’s layered architectural history. Shikhara of Bhimashankar Mandir showcasing Nagara Mandir architecture, marked by a tiered vertical form.https://shreebhimashankar.com/en/bhimashanka… The Mandir complex includes a sabhamandap (assembly hall) added during the 18th century Peshwa period and a Portuguese bell believed to have been brought from Vasai after the Maratha victory in 1739. The Mandir features a garbhagriha, gudhamandap (enclosed pavilion), and mukhamandap (entrance hall), with carved pillars, court spaces, and carvings that are tied to epic stories. The garbhagriha houses a swayambhu Jyotirlinga, placed at a slightly lower level, directly beneath the shikhara. The garbhagriha connects to an antarala and a gudhamandap, both supported by carved stone pillars. The pillars and door frames display carvings of Devis, Devtas, and other narrative figures, showing influence from Jain mandir art. Situated on a high platform amidst the forested hills of the Bhimashankar Wildlife Sanctuary, the Mandir integrates sacred architecture with its natural surroundings. Bhimashankar Mandir’s architecture preserves an early form of Nagara style, with a simple exterior. Its design shows continuity with northern mandir forms, adapted with local materials and techniques, making it a notable architectural example in the district. Shaniwar Wada In the 18th century, Pune emerged as a prominent urban center under the leadership of the Peshwas (1730–1818). Their rule was marked by extensive infrastructural and civic development, including the construction of mandirs, bridges, and residential zones. The Peshwas’ cultural and religious values, in many ways, imparted a Brahmanical character to the city, which became a defining feature of its identity during this period. Among the architectural landmarks of this period was Shaniwar Wada, a notable example of wada architecture. Built in 1732 by Peshwa Bajirao I as his official residence, it served as the seat of Peshwa power and stands as a symbol of 18th-century Maratha administration, culture, and architectural vision. Wada architecture refers to large courtyard houses constructed using local materials and techniques, influenced by Maratha, Mughal, Rajasthani, and Gujarati styles. Originally designed to house single or multiple families, wadas typically featured central courtyards that allowed for light and ventilation, with thick walls and minimal exterior openings suited to Pune’s tropical climate. The layouts reflected social hierarchies and domestic life, prioritizing privacy and climate responsiveness, while incorporating ornate wooden facades and carved detailing. Unlike fortified garhis, wadas were often more ornamented externally, with decorated openings across structural bays. Shaniwar Wada followed this traditional layout, with rooms arranged around courtyards, supported by carved wooden pillars, balconies, and richly decorated limestone niches. The wada once rose to seven storeys and featured four major courts, each dedicated to specific functions such as administration or celebration. Key halls like the Ganpati Rangmahal and Nachacha Diwan showcased elaborate woodwork with enamel and gold detailing, along with ornate fountains. Special rooms served as a treasury, library, armoury, picture gallery, and more. The anterior view of Shaniwar Wada, a notable example of Wada architecture in Pune. The wada was enclosed by 20-foot-high walls, five ft. of stone topped with 15 ft. of brick. The wada has five massive wooden doors: Delhi Darwaza (the main gate facing Delhi), Mastani Darwaza, Khidki Darwaza, Ganesh Darwaza, and Narayan Darwaza. These were flanked by nine bastions. Within its walls were gardens, fountains, and the Hazari Karanje, a Mughal-influenced ornamental fountain with a thousand spouts. Above the main gate stood the Nagarkhana, where drums and shehnais were played each day announcing the grandeur of the Peshwa court. There are various ruins of reservoirs, fountains and residential palaces for the Maratha officials and Peshwas within Shaniwar Wada. Parvati Hill Complex The Parvati Hill Complex, constructed by Nanasaheb Peshwa in the mid-18th century, is a prominent example of religious architecture from the Peshwa period. One of Pune's oldest heritage sites, it served both as a place of worship and as a strategic observation point due to its elevated position overlooking the city. Built in the traditional Peshwa-era architectural style, the complex displays stone masonry and carved shikharas that are distinct from the stucco shikharas seen in later Mandir styles. The fortified complex consists of five principal mandirs and is flanked by arched landings and retaining walls. The Devadeveshwar Mandir in the Parvati Hill mandir complex showcasing an architectural style prominent during the Peshwa-era.https://commons.wikimedia.org/wiki/Category:… St. Paul’s Church Following the decline of Peshwa rule and the British victory in the Battle of Kirkee (1817), Pune began transitioning into a colonial administrative and military hub. This shift led to the establishment of the British Cantonment outside the old city, introducing European spatial planning and architectural styles to the region. One such example of British architectural influence is St. Paul’s Church, located on Agarkar Road and constructed in 1867. Designed by Rev. F. Gell, the church reflects early English Gothic architectural elements, inspired by Sainte-Chapelle in Paris. Its features include narrow pointed arches, a bell tower, gargoyles, and, originally, a high-pitched roof of corrugated iron that was later destroyed in a fire. Gothic architecture, which originated in medieval Europe, is characterized by pointed arches, soaring spires, flying buttresses, and stained-glass windows. These elements were adopted in several colonial-era buildings in Pune, particularly religious and educational institutions, as part of a broader cultural shift introduced by the British. St. Paul’s Church featuring distinctive English Gothic style architecture.https://www.stpaulspune.in/ In addition to St. Paul’s, many other churches were established across the growing city during this time, incorporating Gothic and Neo-Gothic design principles. Notable examples include St. Xavier’s Church in Camp, All Saints’ Church in Khadki, St. Crispin’s Church in Erandwane, and St. Patrick’s Cathedral, which prominently reflects Neo-Gothic architecture. These structures collectively demonstrate the colonial imprint on Pune’s architectural identity. College of Engineering, Pune The College of Engineering, Pune, showcasing Gothic Revival architecture, was established in 1854 and is among the earliest technical institutions in India. It was originally formed as the Poona Engineering Class and Mechanical School and was later developed as a college. The main building, designed by W.S. Howard is an important example of Gothic Revival architecture in Pune, reflecting the broader British architectural influence that shaped much of the city’s 19th-century institutional landscape. The style features classic Gothic elements like pointed arches, vaulted ceilings, and symmetrical stone façades, adapted to suit the academic setting and tropical climate. The imposing structure uses load-bearing stone walls, slender windows, and prominent arches to create a sense of formality and grandeur. College of Engineering Pune is an example of European Gothic revival architecture.https://en.wikipedia.org/wiki/College_of_Eng… Fergusson College Fergusson College showcases Victorian-Gothic architectural features such as pointed arches, exposed stone masonry, sloping tiled roofs, and arched verandas. Built in 1885, it is one of Pune’s most prominent educational institutions from the colonial period. Established by the Deccan Education Society and led by visionaries like Lokmanya Tilak, Gopal Ganesh Agarkar, and Gopal Krishna Gokhale, it was named after Sir James Fergusson, then Governor of Bombay. The main college building was designed and executed by Rao Bahadur Vasudev Balwant Kanitkar. The main building showcases Victorian-Gothic architectural features which reflect a colonial-era adaptation of European styles, set within a 65-acre, tree-lined campus that blends formal British planning with regional construction methods. Fergusson College is a prominent landmark in Pune featuring Gothic-style architecture.https://mr.m.wikipedia.org/wiki/%E0%A4%9A%E0… Mahatma Phule Mandai Among the most notable civic structures from the British era is the Mahatma Phule Mandai, originally known as Reay Market. Constructed between 1882 and 1886 in a Gothic architectural style, the market is located in Shukrawar Peth and features a distinctive octagonal central tower and eight arched entrances. Designed to serve as a retail and wholesale vegetable market, it was named after Lord Reay, then Governor of Bombay. Following independence, the market was renamed in honour of Mahatma Jyotirao Phule, the prominent social reformer from Pune. Even today, Mahatma Phule Mandai functions as the city’s largest vegetable market with over 520 stalls. Notably, the structure remains a symbol of Pune’s colonial past and is a relic of British civic architecture. Mahatma Phule Mandai is built in a distinctive Gothic architectural style and is a notable symbol of Pune’s colonial pasthttps://en.wikipedia.org/wiki/Mahathma_Phule… Aga Khan Palace The Aga Khan Palace, featuring the Indo-Saracenic architectural style, is a prominent example of British-era architecture in Pune. Constructed in 1892 by Sir Sultan Muhammed Shah Aga Khan III, the palace was originally intended as a charitable project during a famine, but later functioned as a seasonal residence. The architectural style blends Islamic and Indian influences with colonial-British elements. The building follows a barrack-style plan, with barn-like chambers connected through arcaded verandas rather than interior corridors. Its stuccoed brick walls, stone base, and pitched roof supported by decorative iron cantilevers define its structural composition. Key features include Italian arches, wooden beams, stone and wood flooring, and an entrance hall with clerestory windows, Gothic tracery, and rose windows. The porch, adorned with medallions marked ‘H.H.A.K.’ (abbreviation for His Highness the Aga Khan), is supported by ornate arches and flanked by corner pavilions with hipped tiled roofs. The verandas across each level feature black stone columns below and white balustraded columns above, divided into bays by pilasters. The building’s form and ornamentation exemplify the colonial-era aesthetic while reflecting a blend of Indian and European traditions. The anterior view of the Aga Khan Palace, an example of Indo-Saracenic architectural style in Pune. Bank of Maharashtra Building Following the British colonial period, Pune’s architectural landscape began to reflect new aspirations shaped by independence and modernity. The mid-20th century saw the emergence of Art Deco influences, marking a shift from colonial styles toward contemporary forms. A notable example of this transition is the Bank of Maharashtra building on Bajirao Road in Budhwar Peth, a prominent Art Deco structure in Pune. This building, designed by architect U. M. Apte was constructed in two phases—1954 and 1969. It is inspired by Hamam Street in Fort, Mumbai, and reflects a unique blend of Art Deco and traditional Indian elements. While advances in construction technology progressed more slowly than aesthetic developments, the building is a notable example of Pune’s evolving architectural ambitions during this period. The Bank of Maharashtra building in Budhwar Peth is an example of Art Deco architecture.https://commons.wikimedia.org/wiki/File:Bank… The building’s central tower is topped with a chhatri, stylized in an austere, octagonal shape. The facade of the wings flanking on either side of the tower is organised in a uniform, geometric grid, divided by long buttresses. The structure avoids the typical horizontal streamlining seen in most Art Deco designs and instead emphasizes verticality through painted bands that contrast with the stone façade. These elements create a monumental effect and have come to define the visual identity of Pune’s Art Deco movement. Residential Architecture In Pune, the architecture of homes has seen a temporal change over the centuries. Each residential structure carries the imprint of local history, community life, and a distinctive cultural identity of the district’s many inhabitants in the representative era. As time passes, it is fascinating to see how the private space of ‘home’ has been reimagined across different eras, often affected by the larger ‘public’ trends that take place outside of it. Traditional wada, representative of architecture trends rooted in Peshwa and Maratha culture, have gradually given way to townships built according to contemporary architecture practices, reflecting shifts in lifestyle and construction techniques. These changes mirror broader patterns of urbanization, population growth, and evolving cultural dynamics across the district, shaping not only the built environment but also the lived experiences of its residents. Residences from the 1860s on the Rajwada Road in Bhor Village Bhor, once a princely state, is a historical village in Maharashtra known for its scenic beauty and historical sites. The village is home to the Bhor Rajwada, the official, royal residence and seat of the Rajas of the princely state. Royal residences offer a window into the lives of those who once ruled, reflecting their tastes, traditions, and the architectural styles of their time. The areas surrounding the wadas, too, bear remnants of their historical past. The Bhor Rajwada, built in 1869 by Raja Chimnaji Raghunathrao III (ninth ruler of Bhor), stands as a testament to a legacy within the Maratha tradition and borrows from European Renaissance Architecture with a blend of Indian Vernacular and Gothic styles. Surrounding the palace are old wadas, once home to families connected to the royal household, some of which now house government offices and shops. These wadas, like many in Pune’s historic core, embody the architectural and cultural influences of the Maratha and Peshwa periods. Area around the Bhor Rajwada with narrow lanes and old wadas which housed families associated with the royal household. These typically housed multiple families in a joint family system. However, some were later rented out, which altered their original living arrangements. The surrounding area, in many ways, is characteristic of a village settlement with homes tightly packed together and narrow lanes called “bolas” weaving between them. These bolas served as pathways leading to small aangans (courtyards) where a few houses were grouped together. As a central architectural feature of wadas, courtyards were designed to accommodate multiple families or a single household, serving both ruling classes and commoners. These homes often included open verandahs and spacious courtyards, which provided ventilation and functioned as communal spaces for daily interactions. The narrow streets and aangans offer a sense of community by encouraging social interaction and building a close-knit community. The narrow lanes called “bolas” between old residential structures that lend them their intimacy and community engagement. Narrow lanes or “bolas” leading to shared courtyards between houses. A shared courtyard between houses which serves as a common space for social interactions fostering a close-knit community. The old residences in this area follow a distinct architectural pattern characteristic of the period. The residences feature double shutter windows and doors, crafted from wood with panelled designs, though some doors are made of metal, which is perhaps a more recent addition. An old residential building featuring double-shuttered windows and a door, estimated to be built in the 1860s, with brick making up its composite structure. In this Wada, the windows are proportionate to the doors, nearly matching them in height, creating a sense of uniformity in the structure. Small, high-placed windows with iron grills allow for ventilation while maintaining privacy within the house. The residences are built using a combination of materials, primarily cement and bricks. An old residence estimated to have been built in the 1860s, featuring a double-shuttered, panelled wooden door and small windows for ventilation. Bhausaheb Rangari Wada in Budhwar Peth The central city areas of Pune, the peths, form the city’s original urban settlement from the Peshwa period. During this time, wadas were a common style of residential architecture. Notably, many of the wadas in the Peth areas today are from this era. Under British rule, Pune was part of the Bombay Presidency and became a center for anti-colonial activities. Many freedom fighters and social reformers, including Tilak, Gokhale, Ranade, Agarkar, Phule, and Karve, were active in the city. Alongside them were lesser-known figures whose homes became gathering places for discussions and planning. One such place was Bhausaheb Rangari Bhavan. Bhausaheb Rangari aka Shrimant Bhausaheb Laxman Javale (1851-1905) was one of the great revolutionaries of Pune. It is estimated that he built his residence, the “Bhausaheb Rangari Wada”, in 1883 as a space for the community to come together with a common vision of freedom. Bhausaheb Rangari Wada, a 19th-century residence in Pune. Notice its wooden construction - is said to be a characteristic feature of Wada architecture of the Peth areas in which it lies. An Ayurvedic vaidya by profession, he dreamt of an independent India free from the British and was among the first to advocate for a sarvajanik (public) celebration of the Ganpati festival as a medium to rally people to the cause of freedom in Pune. In remembrance of this legacy, the wada continues to feature the main chariot of the Bhau Rangari Ganpati which was used initially by the trust to take out a public Ganeshotsava procession in Pune. It is still used today and has been maintained in its original form. The Bhau Rangari Ganpati chariot, maintained in its original form, has been used for several years to lead public Ganeshotsava processions. The wada bears many quiet traces of Bhausaheb’s legacy and his connections to the Freedom Movement. Above the devghar, a concealed compartment was built to hide weapons, swords and pistols said to have been taken from British police. In its own way, the house became part of a larger story, reflecting how residential spaces were tied into the currents of resistance. A concealed space above the Devghar used by freedom fighters and social reformers to hide weapons seized from the British police. The residence is a mix of wood and modern composite materials such as cement and bricks. The wada retains its original wooden features, such as staircases, doors, and windows. The Pune Municipal Corporation (PMC), with the help of its patron, Puneet Balan, restored the old wada in 2022, leaving its original features untouched. The staircase leading to the first floor is narrow and made of wood. It has no central landing and is steeper than modern staircases. A narrow wooden staircase inside the wada, with a photograph of Bhausaheb Laxman Javale displayed at the landing. The architectural details and elements of the residence are striking, and the use of wood is noticeable at first glance. The wada retains its original construction using bricks, wooden balconies, elongated rectangular windows and sloping roofs. The doors are constructed from wooden planks arranged in panel patterns. The main entrance door features a dark brown color with golden metal embellishments. Traditionally, it is said that the doors of a wada represented the wealth and social status of the family residing within. While wadas of wealthier families would have heavily decorated doors as a show of their affluence while wadas belonging to the middle-class featured simpler wooden doors. The main entrance door of this residence follows that tradition, featuring a dark brown color with golden metal embellishments. A deep-brown wooden door with golden embellishments at the main entrance of the wada. To the left of the entrance, there is a passage bordered by wooden railings. Below is a concealed underground passage which was used by the wada’s inhabitants to escape and hide from the British. While the tunnel appears to extend in both directions, a mirror has been placed at one end to mislead intruders. A concealed underground passage used by inhabitants of the wada to flee from the British enclosed by a wooden railing. On the second storey, each window is divided into three sections: an upper portion with stained glass, a middle portion for ventilation, and a bottom portion with railings. The latter two with panes that open outward to allow light entry. The windows on the top storey, too, are divided into two parts: the bottom is enclosed with grills while the top portion has panes that open outward to allow light and ventilation. A three-piece window featuring a stained-glass top, a ventilated middle section, and a grilled bottom, with double-door shutters that open outward. Box windows on the third storey featuring double-door shutters in the top half that open outward and metal railings enclosing the bottom half. A Residence from the mid-20th Century in Velhe Rajgad taluka in Pune district is home to several villages where local building traditions are tied closely to the landscape, climate, and materials found in the region. One such village is Velhe, where this residence, built around 80 years ago, sits at the edge of the main market street on contoured land. The exterior of the residence shows distinct building material-basalt stone plinth and walls made from bamboo sheets, coated with mud plaster and lime. The house rests on a plinth constructed from basalt stone on a perhaps uneven terrain. The exterior walls are made of bamboo sheets, coated with mud plaster and lime, blending the house with its surroundings while keeping the interior cool. The construction perhaps building practices typical to the region at the time. The roof is made of a bamboo framework covered with metal sheets. Wooden columns serve as vertical supports, reinforcing the framework and complementing the rustic aesthetic of the house. The flooring, made from basalt stone, is left in its natural state, lending an earthy character to the space. A rustic interior featuring basalt stone in its natural form, adding an earthy and timeless character to the space. Notably, the spatial layout of the house appears to reflect the agrarian setting of the village and the occupational needs of its residents. It includes a cattle shed and storage areas for agricultural produce, along with a living room, a swayampak ghar (kitchen), and private rooms. A drain runs along the periphery of the structure to manage both rainwater and wastewater. A Residence from the late 20th Century in Velhe The main market street of Velhe bears remnants of past architectural features among the newer constructions. Built around the mid-1990s, this residence demonstrates a mix of old and recent architectural features with a structure of wooden framework and brickwork. Originally, locals say that the residences in the main market street of Velhe had a structure of wooden frameworks which burnt down in a fire in the market. More recently, residences are being constructed with composite materials such as bricks and cement. The below residence shares features from both eras – a partial wooden framework supplemented by brickwork. An old residence blending traditional wooden frameworks with modern brickwork. The ground floor of the residence has a wooden verandah with stone tiling in the front of the house. Double-shuttered wooden doors open up to form a small convenience store in the centre and steps leading up to the second floor of the house where the family resides. The steps are concrete while the railings have a typical wooden top rail with vertical metal rod grills. The residence has a neutral color scheme with a pop of blue that highlights the convenience store. A neutral-colored wooden verandah with a pop of blue highlighting the convenience store. Railing with concrete steps and blue-colored wood and metal railings leading up to the private residences on the second storey. Shahabad stone tile flooring with granite finishing. A Residential Building from 2000s in Bibwewadi As time passes, one can see how new architectural styles gradually begin to reshape the region’s landscape. Bibwewadi, a locality in the south of Pune city often described as a “developing area,” is evidence of this transition. Over the 21st Century, mid-rise buildings have increasingly become part of the locality’s built environment (a technical term for the human-made surroundings that make up a community). Among them is Tejashree Society, a residential society built in phases and completed around 2001. The interior of the residential society with a stone-tiled pathway in front of the building. The composite structure of the building very much aligns with urban mainstream practices of the current day. The building has a reinforced cement concrete (RCC) column structure with brick walls and a plaster finish. The project has been developed in phases with Phase II, III and IV within the same compound. Within Phase IV, there are two buildings, each of four storeys. The main entrance has a mild steel grill door on the outside followed by an inside door which is wood and polish. Main entrance with a metal outer door and wooden inner door. Notice, some windows of the building have a ‘Chajja’, a projected element just above the window, which shades the opening, stops rain from entering the room, and reduces sky glare while looking out of the room. Interestingly, the feature was popularized post-independence, and formal adoption was encouraged by standards set by the Public Works Department. Most other windows on the building are recessed windows and are fitted with metal grills and sliding glass panels. Windows with a “chajja” for shade, to prevent rain from entering and reduce sky glare. Recessed windows with outer metal grills and sliding glass panels. The Phase IV buildings have an interesting modular color scheme with contrasting colors. The buildings appear to use contrasting rectangular sections of white, dark green and light brown while supporting columns in the garage have been painted olive green. A closer view of the residential building which has an interesting modular color panel design. The building appears to use contrasting rectangular sections of white, dark green and light brown. The society features two landscaped garden areas, accessible exclusively to its residents, fostering a shared community space within the modern residential complex. The first garden, located behind Phase IV, is densely covered with plants and features a natural stream, though its upkeep poses challenges. The second garden, situated near the society’s entrance, serves as a gathering space for residents. These common spaces may serve as a modern reinterpretation of traditional courtyards found in wadas across the city, preserving their role as a focal point for social engagement. Semi-public gardens in residential societies offer a sense of community, much like common courtyards did in wadas. Densely covered garden behind Phase IV with a variety of plants. Common space near the entry to the residential society serving as a space for social interaction. A Residential Building from 2010s in Dhankawadi Dhankawadi, another “developing area” in south Pune, shares a similar transformation journey as Bibwewadi. The area reflects coexistence between older low-rise structures and newer mid-rise buildings. Once a predominantly residential area, it has gradually incorporated commercial spaces, shaping its evolving built environment. Among the vast number of residential spaces is Kumar Panchsheel, a residential society, whose construction was completed in 2013. Entrance to Kumar Panchsheel through the bungalow society which sits amidst a relatively wide concrete road which leads to its residential buildings. The building’s design significantly differs from older homes of the district. It features a larger scale and a relatively more contemporary architectural approach which can typically be seen across many semi-urban and urban regions in the district. The composite structure of the building very much aligns with the mainstream practices of the current day. The residential society is composed of two buildings, each of nine storeys and is located within the compounds of a bungalow society with an interior road leading to Kumar Panchsheel. The buildings feature a modular design with contrasting cream, light brown and grey panels. Internal road within the bungalow society leading to the residential society which is maintained and under the purview of the community. A closer view of the residential building which has a modular design featuring contrasting rectangular panels of cream, light brown and grey. The main entrance is a recessed door of polished wood with steel fittings. A recessed, polished wood door fitted with steel attachment. Metal and glass has been used primarily for the design of the windows. The shutters are glass and have a sliding design, while the grills are metal and are painted white. Rectangular window featuring sliding glass shutters and metal grills. A Residential Township from the early 21st Century in Hinjewadi Over the first few decades of the 21st century, Pune has seen the rise of integrated townships as a distinct phase in its urban development. These large, plotted settlements combine residential units with commercial, educational, and recreational infrastructure, emerging in response to rapid population growth and the pressures it placed on the city’s older housing models. By 2015, it has been noted that Pune had more such townships than any other city in Maharashtra, reflecting a broader shift toward planned, self-contained environments on its urban periphery. Their growing appeal, in many ways, lies in the architectural promise of convenience with amenities, workplaces, and public spaces arranged within a single, planned compound. These townships are largely concentrated in Pune’s suburbs, where land is more readily available for large, plotted developments. One of the most prominent examples is Hinjewadi, a suburb whose transformation began around 2010 and is closely tied to the expansion of Pune’s tech industry. The Rajiv Gandhi Infotech Park, planned and developed by the Maharashtra Industrial Development Corporation (MIDC), was set up in phases and brought a wave of companies and jobs to the area.The influx of new employment opportunities created a growing demand for housing in the area, prompting the development of large-scale townships. One of the earliest among them was Blue Ridge Township, which began construction in 2007. Situated within Phase I of the Rajiv Gandhi Infotech Park, it was designed to include not only residential towers but also a school, a shopping centre, sports facilities, and office spaces. Nearby are major IT companies like Wipro, Infosys, and Accenture, making it easier for many residents to live close to where they work. Entrance to the Blue Ridge Township via a wide cement road. Note the coexistence of commercial and residential spaces within the same compound. The building rises to a non-human scale at a height above other buildings in the area. The building’s design significantly differs from older constructions prevalent in the city and instead features a more contemporary architectural approach. Glass, cement, brick and metal makes up the composite structure of the residential towers, each around 25 storeys high which is taller than other construction projects in the vicinity. The township offers one, two, three, four, and five BHK flats. The amenities and residential spaces are connected by a wide, cemented, two-way internal road shaded on either side by trees. Additionally, stone-tiled footpaths have been constructed within the township which are also shaded by trees. Wide, cemented internal roads of the township bordered by trees on both sides. Stone-tiled footpaths in the township, shaded by trees. The buildings are painted in a neutral palette featuring grey and white with a pop of yellow color mainly seen on the exterior of the top floors. Residential buildings with a neutral color palette of grey and white with pops of yellow color. The main entrance door is a flush door with laminate on both sides and a digital locking system. Internal doors, too, are flush with laminate on both sides. The windows slide open and have powder coated aluminum frames with glass panels. The windows have no grills. The balcony doors, too, have powder coated aluminum frames with glass panels and have metal grills on the bottom half. Powdered aluminum window shutters with glass panes. The balconies in the apartments are noticeably narrow, with only enough room for storage or keeping plants. The design, in many ways, acts as a compact extension of the living space. Narrow balcony attached to the living room of the apartment. The balcony has a wooden floor and a cluster of plants have been kept in it, leaving little space for outdoor seating. The flooring across the apartments are vitrified tiles with only the master bedroom having wooden floorboards. Vitrified cream-colored tiles in the apartments with grout filling at the edges. These new developments and changes in the architectural character of this space from the elements that one can find within the houses or the spatial layout of the whole township, in many ways, reflects how life in Pune is changing. The way these spaces are built, with everything carefully planned out, marks a new chapter in how the city is growing. Sources Adminhhsa. 2021. Know more about Chajja. Healthy Homes.https://healthyhomes.co.in/know-more-about-c… Art Deco Pune. 2022. Bank of Maharashtra building, Bajirao Road, Budhwar Peth. Instagram.https://www.instagram.com/p/CeBY9A1DiDp/?img… Behind Every Temple. Bhimashankar Temple. Behind Every Temple.https://behindeverytemple.org/hindu-temples/… Dipanitha Nath. 2023. Know Your City: How COEP retains its status as a premier institute in India. The Indian Express.https://indianexpress.com/article/cities/pun… Gaurav Kadam. 2023. Exploring Pune's Gothic Heritage: A Journey Through Architectural Splendour. The Free Press Journal.https://www.freepressjournal.in/pune/explori… Government of India. Shaniwarwada. Indian Culture.https://indianculture.gov.in/snippets/shaniw… Heritage Temples. Bhimashankar Temple, Talegaon-Dhamdhere. Heritage Temples.https://heritagetemples.org/pune-project/bhi… Mi Punekar. 2021. Bhor Rajwada. Instagram.https://www.instagram.com/mipunekar.in/?hl=en Nikita Mahajani. 2024. Art Deco Architecture in Pune from the 1940s to the 1960s. Vol 16, no. 2, Rupkatha Journal on Interdisciplinary Studies in Humanities.https://rupkatha.com/V16/n2/v16n207g.pdf Nisha Nambiar. 2025. Panel to inspect all integrated townships in Maha next year. The Times of India.https://timesofindia.indiatimes.com/city/pun… Ramakrishna Nallathiga, Khyati Tewari, Susan Varghese, & Anshal Saboo. 2021. From Satellite Townships to Smart Townships: Evolution of Township Development in Pune, India. Vol. 16, no. 1. Theoretical and Empirical Researches in Urban Management. Rishika Sood. Architecture of Indian Cities Pune- Queen of the Deccan. Rethinking The Future.https://www.re-thinkingthefuture.com/rtf-fre… Samanata Kumar. 2022. The Architecture of Wadas of Maharashtra. Rethinking the Future.https://www.re-thinkingthefuture.com/rtf-fre… Saurabh Agashe. 2019. Venerable trees and a gothic market: heritage-hunting in fast-changing Pune. The Guardian.https://www.theguardian.com/cities/2019/aug/… Shoumojit Bannerjee. 2015. Fergusson College wins heritage status. The Hindu.https://www.thehindu.com/news/national/other… Sushant Kulkarni. 2022. Know Your City: How the Army’s Southern Command became an integral part of Pune’s history. Indian Express.https://indianexpress.com/article/cities/pun… Last updated on 6 November 2025. Help us improve the information on this page by clicking on suggest edits or writing to us. Contents Architecture of Prominent Sites Bhimashankar Mandir Shaniwar Wada Parvati Hill Complex St. Paul’s Church College of Engineering, Pune Fergusson College Mahatma Phule Mandai Aga Khan Palace Bank of Maharashtra Building Residential Architecture Residences from the 1860s on the Rajwada Road in Bhor Village Bhausaheb Rangari Wada in Budhwar Peth A Residence from the mid-20th Century in Velhe A Residence from the late 20th Century in Velhe A Residential Building from 2000s in Bibwewadi A Residential Building from 2010s in Dhankawadi A Residential Township from the early 21st Century in Hinjewadi Sources",
      "links": [
        "https://indiandistricts.in/",
        "https://indiandistricts.in/maharashtra/",
        "https://indiandistricts.in/maharashtra/pune/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/akola/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/amravati/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/beed/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/bhandara/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/buldhana/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/chandrapur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/chhatrapati-sambhaji-nagar/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/dharashiv/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/dhule/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/gadchiroli/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/gondia/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/hingoli/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/jalgaon/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/jalna/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/kolhapur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/latur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/mumbai/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/mumbai-suburban/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/nagpur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/nanded/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/nandurbar/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/nashik/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/palghar/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/parbhani/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/pune/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/raigad/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/ratnagiri/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/sangli/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/satara/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/sindhudurg/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/solapur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/thane/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/wardha/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/washim/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/yavatmal/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/pune/artforms/",
        "https://indiandistricts.in/cultures/maharashtra/pune/cultural-sites/",
        "https://indiandistricts.in/cultures/maharashtra/pune/festivals-fairs/",
        "https://indiandistricts.in/cultures/maharashtra/pune/food/",
        "https://indiandistricts.in/cultures/maharashtra/pune/political-history/",
        "https://indiandistricts.in/cultures/maharashtra/pune/language/",
        "https://indiandistricts.in/cultures/maharashtra/pune/markets/",
        "https://indiandistricts.in/cultures/maharashtra/pune/sports-games/",
        "https://indiandistricts.in/cultures/maharashtra/pune/stories/",
        "https://indiandistricts.in/statistics/maharashtra/pune/agriculture/",
        "https://indiandistricts.in/statistics/maharashtra/pune/demography/",
        "https://indiandistricts.in/statistics/maharashtra/pune/education/",
        "https://indiandistricts.in/statistics/maharashtra/pune/local-politics/",
        "https://indiandistricts.in/statistics/maharashtra/pune/environment/",
        "https://indiandistricts.in/statistics/maharashtra/pune/health/",
        "https://indiandistricts.in/statistics/maharashtra/pune/industry/",
        "https://indiandistricts.in/statistics/maharashtra/pune/labour/",
        "https://indiandistricts.in/statistics/maharashtra/pune/livestock-fisheries/",
        "https://indiandistricts.in/statistics/maharashtra/pune/police-judiciary/",
        "https://indiandistricts.in/statistics/maharashtra/pune/revenue-expenditure/",
        "https://indiandistricts.in/statistics/maharashtra/pune/transport-communication/",
        "https://indiandistricts.in/editor/culture/suggest_edit/123/",
        "https://indiandistricts.in/footersection/leave-us-a-message/",
        "https://shreebhimashankar.com/en/bhimashankar-temple-history/",
        "https://commons.wikimedia.org/wiki/Category:Parvati_Hill",
        "https://www.stpaulspune.in/",
        "https://en.wikipedia.org/wiki/College_of_Engineering,_Pune",
        "https://mr.m.wikipedia.org/wiki/%E0%A4%9A%E0%A4%BF%E0%A4%A4%E0%A5%8D%E0%A4%B0:Fergusson_college_campus_buildings1-Pune-Maharashtra.jpg",
        "https://en.wikipedia.org/wiki/Mahathma_Phule_Mandai",
        "https://commons.wikimedia.org/wiki/File:Bank_of_Maharashtra_,_Bajirao_Road.jpg",
        "https://healthyhomes.co.in/know-more-about-chajja/",
        "https://www.instagram.com/p/CeBY9A1DiDp/?img_index=1",
        "https://behindeverytemple.org/hindu-temples/shiva/bhimashankar-jyotirlinga-temple/",
        "https://indianexpress.com/article/cities/pune/how-coep-retains-its-status-as-a-premier-institute-in-india-8518360/",
        "https://www.freepressjournal.in/pune/exploring-punes-gothic-heritage-a-journey-through-architectural-splendour",
        "https://indianculture.gov.in/snippets/shaniwarwada",
        "https://heritagetemples.org/pune-project/bhimashankar-temple",
        "https://www.instagram.com/mipunekar.in/?hl=en",
        "https://rupkatha.com/V16/n2/v16n207g.pdf",
        "https://timesofindia.indiatimes.com/city/pune/panel-to-inspect-all-integrated-townships-in-maha-next-year/articleshow/116840241.cms",
        "https://www.re-thinkingthefuture.com/rtf-fresh-perspectives/a1251-architecture-of-indian-cities-pune-queen-of-the-deccan/",
        "https://www.re-thinkingthefuture.com/rtf-fresh-perspectives/a828-the-architecture-of-wadas-of-maharashtra/",
        "https://www.theguardian.com/cities/2019/aug/02/from-ancient-trees-to-a-gothic-market-hunting-for-heritage-in-fast-changing-pune-saurabh-agashe",
        "https://www.thehindu.com/news/national/other-states/punes-fergusson-college-wins-ugc-heritage-status/article7396108.ece",
        "https://indianexpress.com/article/cities/pune/pune-know-your-city-army-southern-command-history-7837197/"
      ],
      "images": [
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/shikhara-of-bhimashankar-mandir-showcasing-_Mra7pjs.png",
          "alt": "Shikhara of Bhimashankar Mandir showcasing Nagara Mandir architecture, marked by a tiered vertical form.[1]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/the-anterior-view-of-shaniwar-wada-a-notabl_dByWPWV.jpg",
          "alt": "The anterior view of Shaniwar Wada, a notable example of Wada architecture in Pune. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/there-are-various-ruins-of-reservoirs-fount_Y0KAv2T.jpg",
          "alt": "There are various ruins of reservoirs, fountains and residential palaces for the Maratha officials and Peshwas within Shaniwar Wada. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/the-devadeveshwar-mandir-in-the-parvati-hil_TbHcq9g.jpg",
          "alt": "The Devadeveshwar Mandir in the Parvati Hill mandir complex showcasing an architectural style prominent during the Peshwa-era.[2]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/st-pauls-church-featuring-distinctive-engli_rKzy0K8.png",
          "alt": "St. Paul’s Church featuring distinctive English Gothic style architecture.[3]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/college-of-engineering-pune-is-an-example-o_kunkDvA.png",
          "alt": "College of Engineering Pune is an example of European Gothic revival architecture.[4]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/fergusson-college-is-a-prominent-landmark-i_XIUABa6.png",
          "alt": "Fergusson College is a prominent landmark in Pune featuring Gothic-style architecture.[5]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/mahatma-phule-mandai-is-built-in-a-distinct_vOjepFJ.png",
          "alt": "Mahatma Phule Mandai is built in a distinctive Gothic architectural style and is a notable symbol of Pune’s colonial past[6]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/the-anterior-view-of-the-aga-khan-palace-an_quGHPVV.jpg",
          "alt": "The anterior view of the Aga Khan Palace, an example of Indo-Saracenic architectural style in Pune. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/the-bank-of-maharashtra-building-in-budhwar_LU9dOA6.png",
          "alt": "The Bank of Maharashtra building in Budhwar Peth is an example of Art Deco architecture.[7]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/area-around-the-bhor-rajwada-with-narrow-la_DJgNwuJ.jpg",
          "alt": "Area around the Bhor Rajwada with narrow lanes and old wadas which housed families associated with the royal household. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/the-narrow-lanes-called-bolas-between-old-r_4B5fvKs.jpg",
          "alt": "The narrow lanes called “bolas” between old residential structures that lend them their intimacy and community engagement. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/narrow-lanes-or-bolas-leading-to-shared-cou_wmqiBgW.jpg",
          "alt": "Narrow lanes or “bolas” leading to shared courtyards between houses. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-shared-courtyard-between-houses-which-ser_Bh4ajsU.jpg",
          "alt": "A shared courtyard between houses which serves as a common space for social interactions fostering a close-knit community. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/an-old-residential-building-featuring-doubl_R31A7bg.jpg",
          "alt": "An old residential building featuring double-shuttered windows and a door, estimated to be built in the 1860s, with brick making up its composite structure. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/an-old-residence-estimated-to-have-been-bui_w2PlK5Z.jpg",
          "alt": "An old residence estimated to have been built in the 1860s, featuring a double-shuttered, panelled wooden door and small windows for ventilation. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/bhausaheb-rangari-wada-a-19th-century-resid_aCREKzY.jpg",
          "alt": "Bhausaheb Rangari Wada, a 19th-century residence in Pune. Notice its wooden construction - is said to be a characteristic feature of Wada architecture of the Peth areas in which it lies. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/the-bhau-rangari-ganpati-chariot-maintained_BeLGcK4.jpg",
          "alt": "The Bhau Rangari Ganpati chariot, maintained in its original form, has been used for several years to lead public Ganeshotsava processions. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-concealed-space-above-the-devghar-used-by_SwAmNwr.jpg",
          "alt": "A concealed space above the Devghar used by freedom fighters and social reformers to hide weapons seized from the British police. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-narrow-wooden-staircase-inside-the-wada-w_KI18IxS.jpg",
          "alt": "A narrow wooden staircase inside the wada, with a photograph of Bhausaheb Laxman Javale displayed at the landing. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-deep-brown-wooden-door-with-golden-embell_E9gzvsD.jpg",
          "alt": "A deep-brown wooden door with golden embellishments at the main entrance of the wada. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-concealed-underground-passage-used-by-inh_MrdBzol.jpg",
          "alt": "A concealed underground passage used by inhabitants of the wada to flee from the British enclosed by a wooden railing. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-three-piece-window-featuring-a-stained-gl_hfzEBxt.jpg",
          "alt": "A three-piece window featuring a stained-glass top, a ventilated middle section, and a grilled bottom, with double-door shutters that open outward. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/box-windows-on-the-third-storey-featuring-d_gvYHvq9.jpg",
          "alt": "Box windows on the third storey featuring double-door shutters in the top half that open outward and metal railings enclosing the bottom half. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/the-exterior-of-the-residence-shows-distinc_paiGR1O.png",
          "alt": "The exterior of the residence shows distinct building material-basalt stone plinth and walls made from bamboo sheets, coated with mud plaster and lime. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-rustic-interior-featuring-basalt-stone-in_FtRt6cP.png",
          "alt": "A rustic interior featuring basalt stone in its natural form, adding an earthy and timeless character to the space. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/an-old-residence-blending-traditional-woode_uI1vXue.jpg",
          "alt": "An old residence blending traditional wooden frameworks with modern brickwork. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-neutral-colored-wooden-verandah-with-a-po_hDG8DJL.jpg",
          "alt": "A neutral-colored wooden verandah with a pop of blue highlighting the convenience store. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/railing-with-concrete-steps-and-blue-colore_GNtIMzp.jpg",
          "alt": "Railing with concrete steps and blue-colored wood and metal railings leading up to the private residences on the second storey. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/shahabad-stone-tile-flooring-with-granite-f_YRsyI3u.jpg",
          "alt": "Shahabad stone tile flooring with granite finishing. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/the-interior-of-the-residential-society-wit_jvfZwt4.jpg",
          "alt": "The interior of the residential society with a stone-tiled pathway in front of the building. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/main-entrance-with-a-metal-outer-door-and-w_mEPUGTP.jpg",
          "alt": "Main entrance with a metal outer door and wooden inner door. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/windows-with-a-chajja-for-shade-to-prevent-_CEeiJBo.jpg",
          "alt": "Windows with a “chajja” for shade, to prevent rain from entering and reduce sky glare. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/recessed-windows-with-outer-metal-grills-an_Mq9mAdX.jpg",
          "alt": "Recessed windows with outer metal grills and sliding glass panels. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-closer-view-of-the-residential-building-w_BOdHAPx.jpg",
          "alt": "A closer view of the residential building which has an interesting modular color panel design. The building appears to use contrasting rectangular sections of white, dark green and light brown. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/densely-covered-garden-behind-phase-iv-with_GvBfcbk.jpg",
          "alt": "Densely covered garden behind Phase IV with a variety of plants. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/common-space-near-the-entry-to-the-resident_ESSZB2K.jpg",
          "alt": "Common space near the entry to the residential society serving as a space for social interaction. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/entrance-to-kumar-panchsheel-through-the-bu_y7YJCSP.jpg",
          "alt": "Entrance to Kumar Panchsheel through the bungalow society which sits amidst a relatively wide concrete road which leads to its residential buildings. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/internal-road-within-the-bungalow-society-l_iOb9OAS.jpg",
          "alt": "Internal road within the bungalow society leading to the residential society which is maintained and under the purview of the community. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-closer-view-of-the-residential-building-w_GRW2Tih.jpg",
          "alt": "A closer view of the residential building which has a modular design featuring contrasting rectangular panels of cream, light brown and grey. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/a-recessed-polished-wood-door-fitted-with-s_nQPAx6y.jpg",
          "alt": "A recessed, polished wood door fitted with steel attachment. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/rectangular-window-featuring-sliding-glass-_cnkCS9q.jpg",
          "alt": "Rectangular window featuring sliding glass shutters and metal grills. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/entrance-to-the-blue-ridge-township-via-a-w_KXvqGvK.jpg",
          "alt": "Entrance to the Blue Ridge Township via a wide cement road. Note the coexistence of commercial and residential spaces within the same compound. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/the-building-rises-to-a-non-human-scale-at-_iY7MufW.jpg",
          "alt": "The building rises to a non-human scale at a height above other buildings in the area. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/wide-cemented-internal-roads-of-the-townshi_InNfWg8.jpg",
          "alt": "Wide, cemented internal roads of the township bordered by trees on both sides. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/stone-tiled-footpaths-in-the-township-shade_orcvazo.jpg",
          "alt": "Stone-tiled footpaths in the township, shaded by trees. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/residential-buildings-with-a-neutral-color-_9NGtsI5.jpg",
          "alt": "Residential buildings with a neutral color palette of grey and white with pops of yellow color. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/powdered-aluminum-window-shutters-with-glas_pJgOgRH.jpg",
          "alt": "Powdered aluminum window shutters with glass panes. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/narrow-balcony-attached-to-the-living-room-_jKJTYjx.jpg",
          "alt": "Narrow balcony attached to the living room of the apartment. The balcony has a wooden floor and a cluster of plants have been kept in it, leaving little space for outdoor seating. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/pune/architecture/vitrified-cream-colored-tiles-in-the-apartm_gofsbc1.jpg",
          "alt": "Vitrified cream-colored tiles in the apartments with grout filling at the edges. (Source: CKA Archives)"
        }
      ],
      "structuredData": {}
    },
    {
      "url": "https://indiandistricts.in/",
      "title": "The Districts Project",
      "description": "A comprehensive resource on district-level cultures and statistics of India. Explore and tell us more!",
      "content": "The Districts Project Beta Welcome to the most comprehensive encylopedia of Indian districts. Explore India one district at a time... ...and while you're at it, let us know what we missed! We begin with Maharashtra districts (click on the state to navigate) Ahilyanagar Maharashtra Akola Maharashtra Amravati Maharashtra Beed Maharashtra Bhandara Maharashtra Buldhana Maharashtra Chandrapur Maharashtra Chh. Sambhaji Nagar Maharashtra Dharashiv Maharashtra Dhule Maharashtra Gadchiroli Maharashtra Gondia Maharashtra Hingoli Maharashtra Jalgaon Maharashtra Jalna Maharashtra Kolhapur Maharashtra Latur Maharashtra Mumbai Maharashtra Mumbai Suburban Maharashtra Nagpur Maharashtra Nanded Maharashtra Nandurbar Maharashtra Nashik Maharashtra Palghar Maharashtra Parbhani Maharashtra Pune Maharashtra Raigad Maharashtra Ratnagiri Maharashtra Sangli Maharashtra Satara Maharashtra Sindhudurg Maharashtra Solapur Maharashtra Thane Maharashtra Wardha Maharashtra Washim Maharashtra Yavatmal Maharashtra No districts found /home/mahadev/frontmap.gpkg layer2, states",
      "links": [
        "https://indiandistricts.in/maharashtra/"
      ],
      "images": [],
      "structuredData": {}
    },
    {
      "url": "https://indiandistricts.in/maharashtra/",
      "title": "Maharashtra State",
      "description": "A comprehensive resource on district-level cultures and statistics of Maharashtra. Explore and tell us more!",
      "content": "Home Maharashtra MAHARASHTRA Select State & District... Maharashtra Ahilyanagar Akola Amravati Beed Bhandara Buldhana Chandrapur Chh. Sambhaji Nagar Dharashiv Dhule Gadchiroli Gondia Hingoli Jalgaon Jalna Kolhapur Latur Mumbai Mumbai Suburban Nagpur Nanded Nandurbar Nashik Palghar Parbhani Pune Raigad Ratnagiri Sangli Satara Sindhudurg Solapur Thane Wardha Washim Yavatmal No states or districts found Try adjusting your search terms Raigad Ratnagiri Akola Amravati Chh. Sambhaji Nagar Gondia Beed Buldhana Chandrapur Dhule Gadchiroli Bhandara Hingoli Jalgaon Jalna Kolhapur Latur Mumbai Suburban Nagpur Nanded Nandurbar Nashik Dharashiv Palghar Parbhani Sangli Satara Sindhudurg Solapur Thane Washim Wardha Yavatmal Mumbai Pune Ahilyanagar",
      "links": [
        "https://indiandistricts.in/",
        "https://indiandistricts.in/maharashtra/ahilyanagar/",
        "https://indiandistricts.in/maharashtra/akola/",
        "https://indiandistricts.in/maharashtra/amravati/",
        "https://indiandistricts.in/maharashtra/beed/",
        "https://indiandistricts.in/maharashtra/bhandara/",
        "https://indiandistricts.in/maharashtra/buldhana/",
        "https://indiandistricts.in/maharashtra/chandrapur/",
        "https://indiandistricts.in/maharashtra/chhatrapati-sambhaji-nagar/",
        "https://indiandistricts.in/maharashtra/dharashiv/",
        "https://indiandistricts.in/maharashtra/dhule/",
        "https://indiandistricts.in/maharashtra/gadchiroli/",
        "https://indiandistricts.in/maharashtra/gondia/",
        "https://indiandistricts.in/maharashtra/hingoli/",
        "https://indiandistricts.in/maharashtra/jalgaon/",
        "https://indiandistricts.in/maharashtra/jalna/",
        "https://indiandistricts.in/maharashtra/kolhapur/",
        "https://indiandistricts.in/maharashtra/latur/",
        "https://indiandistricts.in/maharashtra/mumbai/",
        "https://indiandistricts.in/maharashtra/mumbai-suburban/",
        "https://indiandistricts.in/maharashtra/nagpur/",
        "https://indiandistricts.in/maharashtra/nanded/",
        "https://indiandistricts.in/maharashtra/nandurbar/",
        "https://indiandistricts.in/maharashtra/nashik/",
        "https://indiandistricts.in/maharashtra/palghar/",
        "https://indiandistricts.in/maharashtra/parbhani/",
        "https://indiandistricts.in/maharashtra/pune/",
        "https://indiandistricts.in/maharashtra/raigad/",
        "https://indiandistricts.in/maharashtra/ratnagiri/",
        "https://indiandistricts.in/maharashtra/sangli/",
        "https://indiandistricts.in/maharashtra/satara/",
        "https://indiandistricts.in/maharashtra/sindhudurg/",
        "https://indiandistricts.in/maharashtra/solapur/",
        "https://indiandistricts.in/maharashtra/thane/",
        "https://indiandistricts.in/maharashtra/wardha/",
        "https://indiandistricts.in/maharashtra/washim/",
        "https://indiandistricts.in/maharashtra/yavatmal/"
      ],
      "images": [],
      "structuredData": {}
    },
    {
      "url": "https://indiandistricts.in/maharashtra/pune/",
      "title": "Maharashtra | Pune District",
      "description": "Cultures and statistics of Pune district. Explore and tell us more!",
      "content": "Home Maharashtra Pune Pune Ahilyanagar Akola Amravati Beed Bhandara Buldhana Chandrapur Chh. Sambhaji Nagar Dharashiv Dhule Gadchiroli Gondia Hingoli Jalgaon Jalna Kolhapur Latur Mumbai Mumbai Suburban Nagpur Nanded Nandurbar Nashik Palghar Parbhani Pune Raigad Ratnagiri Sangli Satara Sindhudurg Solapur Thane Wardha Washim Yavatmal Introduction Introduction Architecture Artforms Cultural Sites Festivals & Fairs Food History Language Markets Sports & Games Stories Agriculture Demography Education Elections Environment Health Industry Labor Livestock & Fisheries Police & Judiciary Revenue & Expenditure Transport & Communication Suggest Edits Suggest Edits Pune Area 15,643 sq. km Sex Ratio 915 (2011) Population ~1.05 crore (2019) Gross District Domestic Product (GDDP) ~ ₹2.47 lakh crore (2019) GDDP Per Capita ~ ₹2.37 lakh (2019) Pune district, the heart of western Maharashtra, is a region where history, culture, and modernity intertwine. Pune city, its headquarters, lies on the banks of the Mula and Mutha rivers, between the Sahyadri hills and the Deccan plateau. The earliest mentions of Pune date to the 8th century as “Punna” or “Punyavishaya”, a region of sacred confluence and agricultural settlement during the Rashtrakuta era (this name appears in a Rashtrakuta copper plate from 937 AD). Over time, Pune evolved under the Satavahanas, Yadavas, and then experienced periods of prosperity and devastation as a prize in conflicts among the Nizamshahi, Adilshahi, and Mughal dynasties in the early 17th century.​ Pune has been central to Maharashtra’s history for over 400 years. It was ruled by the Deccan Sultanates before becoming a stronghold of the Maratha Empire. Recovery began when Shahaji Bhosale, father of Shivaji, was granted the jagir of Pune, and his wife Jijabai and son Shivaji resided in Lal Mahal (completed 1640) at the town’s core. The rebuilding of Pune by Dadoji Konddeo after the catastrophic famine and destruction of the 1630s set the stage for the city’s golden era. Under the leadership of Balaji Vishwanath (appointed Peshwa by Chhatrapati Shahu in 1713), and his successor Bajirao I (who made Pune his seat of administration in 1720 and built the famed Shaniwar Wada), Pune became the capital of the Maratha Empire and a major power in India throughout the 18th century. British conquest in 1818 shifted Pune’s destiny again, transforming it into the “monsoon capital” of the Bombay Presidency. The British established a prominent cantonment, missionary schools, and public institutions. Pune saw the rise of educational and social reformers, Jyotirao and Savitribai Phule (the first girls’ school in India, 1848), Gopal Krishna Gokhale, and Lokmanya Tilak. By the late 19th century, railways, roads, and dams (the Khadakwasla in 1880) made Pune a thriving industrial and military hub, and the city attracted vibrant communities of Parsis, Jews, Bohras, as well as Hindu and Muslim intellectuals. After India’s independence in 1947, Pune was integrated into Bombay State, later becoming part of Maharashtra in 1960. Today, Pune district consists of 15 talukas: Pune City, Pimpri-Chinchwad, Haveli, Mulshi, Velhe, Bhor, Purandar, Baramati, Daund, Indapur, Maval, Khed, Shirur, Ambegaon, and Junnar. Culturally, Pune district is hailed as Maharashtra’s “cultural capital.” Pune city, sometimes called the “Oxford of the East,” is legendary for its universities, historic colleges, and as a crucible of Marathi theatre, classical music, arts, and social reform. Key sites include Shaniwar Wada, the 18th-century seat of the Peshwas; Aga Khan Palace, associated with Mahatma Gandhi’s imprisonment during the freedom struggle; and the Pataleshwar Cave Mandir, dating back to the 8th century. Spiritual giants like Sant Dnyaneshwar and Sant Tukaram, as well as social pioneers like Jyotirao Phule and Savitribai Phule, worked in and around the district. Festivals such as Ganesh Chaturthi, revived by Tilak as a public celebration to foster unity, are central to Pune’s life. The district is also home to important pilgrimage centers: the Ashtavinayak Ganesh temples, Alandi and Dehu (associated with Varkari saints), Jejuri’s Khandoba temple, and numerous Jain, Sikh, and Sufi shrines. Fine cuisine, literature, museums, and a cosmopolitan student population keep Pune’s traditions vibrant and relevant. Legendary forts, Sinhagad, Rajgad, Purandar, and Shivneri, dot the district’s landscape, reminiscent of its Maratha legacy and empire-building history. The district also features Lonavala and Khandala, popular hill stations dating back to the British Raj. Geographically, Pune lies on the western edge of the Deccan Plateau, in the leeward shadow of the Sahyadri mountain range. Pune district blends lush Sahyadri forests, high valleys, and dry plateau farming. Rivers like the Bhima, Indrayani, Pavana, and Nira cross the district, and hill stations like Lonavala, Khandala, and Panchgani overlook sweeping gorges and waterfalls. Wildlife sanctuaries (Bhimashankar, which has one of the profound Shiva Jyotirlingas) and hundreds of ancient temples contribute to a rich, biodiverse ecosystem. Pune’s rapid urban expansion has turned its former villages into bustling suburbs, blending rural and urban life. Pune is an economic powerhouse. Its history in sugar cooperatives and cotton markets gave way to engineering, automobile manufacturing and electronics thanks to the growth of MIDC estates. In last two decades, Pune surged ahead as an IT and knowledge economy hub, with tech parks (Hinjawadi, Magarpatta), BPOs, and international firms. The city is India’s vaccine capital (Serum Institute), home to defense research, scientific innovation, and a robust real estate market. Major defense and scientific organizations, such as the National Chemical Laboratory, ARM Engineering College, the NDA, and DRDO labs, make Pune a center for innovation and research. Education, healthcare, retail, real estate, and a growing tourism sector (thanks to heritage and eco-getaways) round out Pune’s bustling economy. Agriculture persists in the hinterlands with grapes, guavas, pomegranates, rice, and other crops, supporting rural livelihoods alongside the district’s urban affluence. Explore Pune Cultures Architecture Artforms Cultural Sites Festivals & Fairs Food History Language Markets Sports & Games Stories Statistics Agriculture Demography Education Elections Environment Health Industry Labor Livestock & Fisheries Police & Judiciary Revenue & Expenditure Transport & Communication",
      "links": [
        "https://indiandistricts.in/",
        "https://indiandistricts.in/maharashtra/",
        "https://indiandistricts.in/maharashtra/ahilyanagar/",
        "https://indiandistricts.in/maharashtra/akola/",
        "https://indiandistricts.in/maharashtra/amravati/",
        "https://indiandistricts.in/maharashtra/beed/",
        "https://indiandistricts.in/maharashtra/bhandara/",
        "https://indiandistricts.in/maharashtra/buldhana/",
        "https://indiandistricts.in/maharashtra/chandrapur/",
        "https://indiandistricts.in/maharashtra/chhatrapati-sambhaji-nagar/",
        "https://indiandistricts.in/maharashtra/dharashiv/",
        "https://indiandistricts.in/maharashtra/dhule/",
        "https://indiandistricts.in/maharashtra/gadchiroli/",
        "https://indiandistricts.in/maharashtra/gondia/",
        "https://indiandistricts.in/maharashtra/hingoli/",
        "https://indiandistricts.in/maharashtra/jalgaon/",
        "https://indiandistricts.in/maharashtra/jalna/",
        "https://indiandistricts.in/maharashtra/kolhapur/",
        "https://indiandistricts.in/maharashtra/latur/",
        "https://indiandistricts.in/maharashtra/mumbai/",
        "https://indiandistricts.in/maharashtra/mumbai-suburban/",
        "https://indiandistricts.in/maharashtra/nagpur/",
        "https://indiandistricts.in/maharashtra/nanded/",
        "https://indiandistricts.in/maharashtra/nandurbar/",
        "https://indiandistricts.in/maharashtra/nashik/",
        "https://indiandistricts.in/maharashtra/palghar/",
        "https://indiandistricts.in/maharashtra/parbhani/",
        "https://indiandistricts.in/maharashtra/pune/",
        "https://indiandistricts.in/maharashtra/raigad/",
        "https://indiandistricts.in/maharashtra/ratnagiri/",
        "https://indiandistricts.in/maharashtra/sangli/",
        "https://indiandistricts.in/maharashtra/satara/",
        "https://indiandistricts.in/maharashtra/sindhudurg/",
        "https://indiandistricts.in/maharashtra/solapur/",
        "https://indiandistricts.in/maharashtra/thane/",
        "https://indiandistricts.in/maharashtra/wardha/",
        "https://indiandistricts.in/maharashtra/washim/",
        "https://indiandistricts.in/maharashtra/yavatmal/",
        "https://indiandistricts.in/cultures/maharashtra/pune/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/pune/artforms/",
        "https://indiandistricts.in/cultures/maharashtra/pune/cultural-sites/",
        "https://indiandistricts.in/cultures/maharashtra/pune/festivals-fairs/",
        "https://indiandistricts.in/cultures/maharashtra/pune/food/",
        "https://indiandistricts.in/cultures/maharashtra/pune/political-history/",
        "https://indiandistricts.in/cultures/maharashtra/pune/language/",
        "https://indiandistricts.in/cultures/maharashtra/pune/markets/",
        "https://indiandistricts.in/cultures/maharashtra/pune/sports-games/",
        "https://indiandistricts.in/cultures/maharashtra/pune/stories/",
        "https://indiandistricts.in/statistics/maharashtra/pune/agriculture/",
        "https://indiandistricts.in/statistics/maharashtra/pune/demography/",
        "https://indiandistricts.in/statistics/maharashtra/pune/education/",
        "https://indiandistricts.in/statistics/maharashtra/pune/local-politics/",
        "https://indiandistricts.in/statistics/maharashtra/pune/environment/",
        "https://indiandistricts.in/statistics/maharashtra/pune/health/",
        "https://indiandistricts.in/statistics/maharashtra/pune/industry/",
        "https://indiandistricts.in/statistics/maharashtra/pune/labour/",
        "https://indiandistricts.in/statistics/maharashtra/pune/livestock-fisheries/",
        "https://indiandistricts.in/statistics/maharashtra/pune/police-judiciary/",
        "https://indiandistricts.in/statistics/maharashtra/pune/revenue-expenditure/",
        "https://indiandistricts.in/statistics/maharashtra/pune/transport-communication/",
        "https://indiandistricts.in/editor/district/1/suggest-intro/"
      ],
      "images": [
        {
          "src": "https://indiandistricts.in/media/CACHE/images/district_images/originals/Talukas_ngHKqqV/8533dbce9d864018fc02d1e735fa82cf.webp",
          "alt": "Pune"
        },
        {
          "src": "https://indiandistricts.in/media/gif_images/originals/City_Growth_DEnYEzd.gif",
          "alt": ""
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/architecture.png",
          "alt": "Architecture"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/artforms.png",
          "alt": "Artforms"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/cultural_sites.png",
          "alt": "Cultural Sites"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/fair_festivals.png",
          "alt": "Festivals & Fairs"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/food.png",
          "alt": "Food"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/history.png",
          "alt": "History"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/languages.png",
          "alt": "Language"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/market.png",
          "alt": "Markets"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/sports_games.png",
          "alt": "Sports & Games"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/stories.png",
          "alt": "Stories"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/agriculture.png",
          "alt": "Agriculture"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/demography.png",
          "alt": "Demography"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/education.png",
          "alt": "Education"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/elections.png",
          "alt": "Elections"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/environment.png",
          "alt": "Environment"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/health.png",
          "alt": "Health"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/industry.png",
          "alt": "Industry"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/labor.png",
          "alt": "Labor"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/livestock_fisheries.png",
          "alt": "Livestock & Fisheries"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/police_judiciary.png",
          "alt": "Police & Judiciary"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/revenue.png",
          "alt": "Revenue & Expenditure"
        },
        {
          "src": "https://indiandistricts.in/static/img/icons/transcomm.png",
          "alt": "Transport & Communication"
        }
      ],
      "structuredData": {}
    },
    {
      "url": "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/architecture/",
      "title": "Architecture - Ahilyanagar",
      "description": "Explore Architecture in Ahilyanagar district.",
      "content": "Home Maharashtra Ahilyanagar Architecture Ahilyanagar Ahilyanagar Akola Amravati Beed Bhandara Buldhana Chandrapur Chh. Sambhaji Nagar Dharashiv Dhule Gadchiroli Gondia Hingoli Jalgaon Jalna Kolhapur Latur Mumbai Mumbai Suburban Nagpur Nanded Nandurbar Nashik Palghar Parbhani Pune Raigad Ratnagiri Sangli Satara Sindhudurg Solapur Thane Wardha Washim Yavatmal Architecture Introduction Architecture Artforms Cultural Sites Festivals & Fairs Food History Language Markets Sports & Games Stories Agriculture Demography Education Elections Environment Health Industry Labor Livestock & Fisheries Police & Judiciary Revenue & Expenditure Transport & Communication Suggest Edits Suggest Edits Contents Architecture of Prominent Sites Dhokeshwar Cave, Takli Ahmednagar Fort Bagh Rauza Farah Baksh Mahal Salabat Khan’s Tomb Vishal Ganpati Mandir Hume Memorial Church Shri Datta Mandir Residential Architecture A late 19th Century Residence at Shimpi Galli A 20th Century Residence at Khist Galli A Late-20th Century Residence at the Gulmohar Road of Savedi A Residential Building at Shrigonda Bypass Sources AHILYANAGAR Architecture Last updated on 6 November 2025. Help us improve the information on this page by clicking on suggest edits or writing to us. Architecture of Prominent Sites Ahilyanagar’s architecture reflects a layered history of religious, power, and cultural reinvention. Early sites like the Dhokeshwar Cave show how rock-cut forms shaped early medieval religious practice, while Nizam Shahi-era tombs, forts, and water palaces introduce Indo-Islamic styles tied to political control. Later Maratha and colonial structures, like the Vishal Ganpati Mandir and Hume Memorial Church, added new materials and forms, blending continuity with change. Across mandirs, palaces, and public spaces, Ahilyanagar’s built heritage reveals how belief and authority have continually reshaped its landscape. Dhokeshwar Cave, Takli The Takli Dhokeshwar Cave is a rock-cut Mandir carved into the hillside near Takli village, about 40 km from Ahilyanagar city. Believed to date back to the mid-7th century CE, the cave is located atop a hill, accessible by a long flight of stairs from Takli Dhokeshwar village along the Nagar-Kalyan road. The Takli Dhokeshwar Cave is a rock-cut mandir, reached by climbing a long flight of stairs up the hill. The Dhokeshwar Cave features a large hall with triple cells, measuring about 18.3 meters deep and 13.7 meters wide. The front façade includes two massive square pillars and two pilasters, supporting a large architrave that runs across the Mandir. Within this is the garbhagriha (sanctum), carved from a freestanding rectangular block of rock, surrounded by a dark circumambulatory passage. A square linga pitha, carved from the natural bedrock, sits at the center of the garbhagriha. The mandap (pillared hall) area includes two free-standing pillars, positioned parallel to the façade pillars. Dvarapalas are sculpted outside the garbhagriha in Abhanga pose. The garbhagrihahttps://commons.wikimedia.org/wiki/File:View… The cave walls display carved depictions of devtas and devis from the Pandavas’ era. These include Bhagwan Ganesh, Bhairav, Mahadev, Sahamata, Tandaveshwar, Ashtasiddhi, and others. A notable feature is the large Nandi murti, measuring about 10 ft long and 5 ft high, facing the garbhagriha. Flanking the east-facing cave entrance are carvings of the river Devis, Yamuna to the south with Kurma beneath her, and Ganga to the north. Inside, a carving of the Saptamatrukas (seven mother Devis), flanked by Bhagwan Shiv-Virabhadra and Bhagwan Ganesh, adorns the south wall. The Dhokeshwar Caves reflect the technical skill of early medieval rock-cut architecture, with their spacious interior, detailed iconography, and experimentation with structural forms. Ahmednagar Fort The Ahmednagar Fort follows the architectural style of a Bhuikot fort, or ground fort, built on flat plains rather than a hilltop. The fort was constructed in 1490 CE by Malik Ahmad Nizam Shah, the founder of the Nizam Shahi dynasty, alongside the establishment of the city of Ahilyanagar. The Ahmednagar Fort is oval-shaped with a circumference of about 1.68 km, featuring 24 bastions and a large moat surrounding its stone walls. Originally built with mud, the fort was later strengthened with stone during the reign of Hussain Nizam Shah in the mid-16th century. Its defensive features included thick stone walls, a deep moat, and a drawbridge, making it one of the most well-planned and impregnable forts in Maharashtra. Ahmednagar Forthttps://upload.wikimedia.org/wikipedia/commo… Bagh Rauza Bagh Rauza follows the Indo-Islamic architectural style, blending influences from late Bahmani and early Nizam Shahi styles. Located on the northeastern outskirts of Ahilyanagar, the mausoleum was built in the early 16th century as the resting place of Malik Ahmad Nizam Shah I, founder of the Nizam Shahi dynasty and Ahilyanagar (previously Ahmednagar) city. Bagh Rauza is an Indo-Islamic tomb complex with a black basalt stone mausoleum featuring a white-plastered dome, enclosed within high boundary walls.https://commons.wikimedia.org/wiki/File:Tomb… Bagh Rauza is a square tomb complex enclosed by high boundary walls, with entrances on the north, east, and south sides. At the center stands the main mausoleum, raised on a high platform and constructed from black basalt stone. The building features a hemispherical dome made of brick and lime mortar, coated in white plaster. Inside the tomb, verses from the Quran are inscribed in gold lettering along the walls. The dome over Ahmad Nizam Shah’s shrine is the largest and most intricately detailed within the complex, reflecting Mughal and Persian stylistic influences. Farah Baksh Mahal Farah Baksh Mahal (also Farakh Baksh jalmahal) is a water palace designed in the Indo-Islamic architectural style, blending Persian and Deccan Sultanate influences. The palace was completed in 1583 by Salabat Khan II during the reign of the Nizam Shahi dynasty. Located along the Solapur road, the octagonal palace was built at the center of a now-dry quadrangular lake and once formed part of a larger palace-garden complex known as Farah Bagh. Farah Baksh Mahal is a two-storey Indo-Islamic water palace built from basalt stone, with thick lime plaster blending stone, pottery, and natural fibers.https://upload.wikimedia.org/wikipedia/commo… Farah Baksh Mahal is a two-storey structure built primarily from locally quarried basalt stone, joined with lime mortar and finished with thick lime plaster containing stone, pottery, jute fiber, and dry paddy stem for strength and flexibility. The palace is elevated on a five-foot-high platform and features a central domed hall, surrounded by flat-roofed upper chambers and nine arched openings on each side to facilitate cross-ventilation. The structure once included a system of fountains inside and around the palace, integrated with a subterranean water channel. The interior has recessed wall niches, carved teakwood lintels, and remnants of stucco ornamentation, reflecting the functional yet refined features of the Nizam Shahi architectural style. The interior of Farah Baksh Mahal features recessed niches, carved teakwood lintels, and traces of stucco work. Salabat Khan’s Tomb Salabat Khan’s Tomb, erroneously referred to as the Chand Bibi Mahal, follows the Indo-Islamic architectural style and is located atop the Shah Dongar plateau in Ahilyanagar. Built in the late 16th century, the tomb was commissioned for Salabat Khan II, the respected minister of Murtaza Nizam Shah I of the Ahmadnagar Sultanate. Salabat Khan’s Tomb is an octagonal, three-storeyed stone structure in the Indo-Islamic style.https://commons.wikimedia.org/wiki/File:Sala… Architecturally, the tomb is simple, with minimal ornamentation. It is an octagonal, three-storeyed stone structure, measuring approximately 939m above sea level. Each storey is surrounded by verandahs with large casement openings, allowing light and air to enter from all directions. A popular local belief claims that the tomb was originally intended to be eight storeys tall, allowing one to see Delhi or Daulatabad from its highest point. However, only three storeys were completed. Vishal Ganpati Mandir The Vishal Ganpati Mandir follows the traditional Maratha architectural style, characterized by its ornate yet sturdy design. Located in the Maliwada area of Ahilyanagar, the Mandir is estimated to be around 400 to 450 years old and is locally regarded as the gram devta of the district. Originally constructed from wood, the current structure was later rebuilt using Makrana marble (a type of marble notably used to build the Taj Mahal), lending it a striking white appearance. The Vishal Ganpati Mandir, built in the traditional Maratha architectural style, features ornate arched windows, finely carved stone panels, and a domed shikhara. Reconstructed using Makrana marble, it has a striking white exterior. The Vishal Ganpati Mandir stands approximately 70 feet tall, with its prominent shikhara and kalash visible from surrounding neighborhoods. The Mandir’s exterior features decorative arched windows (jharokhas), finely carved stone panels, and a domed shikhara typical of Maratha mandir architecture. Hume Memorial Church The Hume Memorial Church draws inspiration from Gothic Revival architecture. This Presbyterian church was constructed between 1902 and 1906 in the Khisti Galli area of Ahilyanagar and was named after Rev. Dr. Robert Allen Hume, one of the first American missionaries to settle in the region. The Hume Memorial Church, inspired by Gothic Revival architecture, is built from locally sourced stone. It features a pitched roof with a wooden truss system and beautiful stained-glass windows. The Hume Memorial Church is built using locally sourced stone and features a pitched roof supported by a wooden truss system. The church’s stained-glass windows, designed with lotus flower motifs, introduce soft colored light into the space and are representative of European Gothic cathedrals. The interior showcases extensive use of teak (Sangwan) wood in the pews, balconies, and ceiling, reflecting skilled timber craftsmanship. Shri Datta Mandir Shri Datta Mandir follows the architectural style of a modern Navaratna mandir, blending traditional Indian mandir design with contemporary construction methods. The Mandir, located near Premdan Chowk in Savedi, was constructed in the early 21s century and is believed to be one of the largest Datta mandirs in India. Built entirely from Gulabi Bansi Paharpur Dagad (pink Rajasthani stone), the structure stands as a significant architectural landmark in the city. Shri Datta Mandir, built from Gulabi Bansi Paharpur Dagad, follows the modern Navaratna mandir style. Shri Datta Mandir is notable for its use of pink sandstone and the absence of iron in its construction. The Mandir measures approximately 160 ft. in length, 90 ft. in width, and rises to a height of 90 ft. A team of Rajasthani artisans crafted the intricate stone carvings that adorn the temple walls. Along the sides of the staircase leading to the main sanctum, sculptural panels depict Bhagwan Krishna lifting Mount Govardhan and Bhagwan Hanuman with the Vanar Sena building the stone bridge to Lanka, adding rich narrative elements to the Mandir's design. A sculptural panel depicting Bhagwan Hanuman with the Vanar Sena constructing the stone bridge to Lanka, capturing a key moment from the Ramayan in intricate stone carving. Residential Architecture A late 19th Century Residence at Shimpi Galli Shimpi Galli is a narrow lane situated in the Shrigonda taluka of Ahilyanagar. This area contains a settlement that according to local accounts was formed in the 1880s. Notably, there are many old residential structures which can be found within this galli. Among these structures stands a two-storey residence believed to have been built in 1882. A residential structure situated at the Shimpi Galli which is said to have been built in the 1880s. The old residential structures and the intimate character of the lanes of Shimpi Galli. The architectural character and design of this residence is very distinctive. The composite structure (a technical term used to describe the materials that make up the house) of the house consists of both stone and brick. The ground floor is constructed from black basalt stone blocks, while the upper floor consists of exposed brick. The composite structure of the house shows distinct building materials on each floor—stone on the ground level and brick on the upper storey. Similar architectural patterns appear in buildings throughout the area, where brick parapets contrast with stone foundations, each showcasing the unique masonry of a bygone era. The architectural details and elements of the residence are striking. The doors are constructed from wooden planks arranged in panel patterns. The main entrance features a distinctive turmeric yellow color scheme and includes a small niche above the doorway. The small niche, notably, is tied to a cultural belief. It is traditionally used for placing devis and devtas that the home’s inhabitants revere as their guardian deities. The interior doors are around 5 ft. in height. Main entrance with yellow-painted wooden panels and decorative elements. Above the door, a carved niche, distinct in color, is traditionally used to place an image or murti of a devi or devta with the belief that they will protect the home. A half-height railing is attached to the door as a safety barrier. A blue-colored door which matches the shade of the beautiful decorative elements that adorn the second story. The windows feature iron rods arranged horizontally in a style regionally known as “Gajachya khidkya.” Each window is divided into two sections, an upper portion for ventilation and lower panes that open inward to allow light entry. The windows are relatively small due to the stone construction and load-bearing design. Set within niches with rounded tops (a characteristic element which can be found in Maharashtra) these windows are accentuated with contrasting colors. Traditional “Gajachya khidkya” windows set within niches with rounded tops and contrasting colors. The windows have horizontal and very symmetrical iron grills that are overshadowed by the metal mesh, which was likely added later. The external railings are a distinctive architectural feature of the residence. These decorative elements extend around the residence’s perimeter with a cornice displaying geometric and floral motifs. The railings consist of metal square pipes arranged horizontally, supported by a wooden cornice. Interior railings incorporate precast iron panels painted white, supported by wooden columns, with a half-round wooden top rail finished in blue. Decorative railings with wooden cornice and metal elements found both in the interior and exterior of the house. Decorative railings featuring geometric and floral motifs. The residence includes an internal courtyard with wooden rafters supporting a metal sheet covering, which was most likely added later. The interior walls contain wooden columns that provide structural support, with rafters holding the roofing planks. The wooden rafters that form the roof structure. The metal sheet roofing in the courtyard, which was likely a later addition. The ground floor ceiling consists of wooden members covered with planks that serve as the floor for the upper level. Throughout the house, there are various spaces that reveal the contrast between original construction and subsequent additions. Still today, the house stands as a remnant of the architectural styles that were once commonly found across the district. A 20th Century Residence at Khist Galli Khist Galli is a residential area within Ahilyanagar City. The locality is approximately 100 years old, with the Maliwada Mandir serving as a notable landmark. Within this area stands a one-storey residential structure, estimated to have been built in 1931, which strikingly has a very distinct architectural character. A beautiful and unique residence which lies in the Khist Galli of Ahilyanagar City. This residence is part of a cluster of older homes in the galli. These structures, designed in a historical architectural style, offer a striking contrast to the new concrete buildings that now define much of the locality’s street character. Yet, in this quiet juxtaposition, they offer a rare, and increasingly important, insight into the architectural heritage of the locality. A residential structure which stands on the opposite side of the street. Interestingly, the two houses share a similar color scheme. A view of both residential structures and the narrow road that passes in the middle. The residential building features a plinth (a technical term used for the base of the structure) constructed of random course stone masonry finished with plaster and paint. The composite structure is primarily made up of brick which is both plastered and painted. The house stands approximately 2.5 times the human height. The height and plinth of the house which stands in contrast against a human scale. The balcony projection features a wooden cantilever structure, visible beneath the unplastered, triangular parapet. The house has two entrances, with the front door positioned at the center of the facade on an elevated surface. The front entrance of the house. The back entrance of the house. The main entrance sits on a small plinth with central steps, known locally as ‘payrya.’ The entrance features two doors, an iron safety door and a wooden paneled door with decorative carvings. The doors of the house each have a very distinct design. Many doors at the back entrance of the house are wooden and painted in pink and cream white. The main door includes ring knockers on both panels and is flanked by two foldable wooden ledges used as ‘devli’s’ for placing oil lamps during festivals. The main door displays decorative floral carvings with metal studs. The back entrance doors of the house are painted in pink and white cream shades. The door features many interesting architectural elements. It has a distinctive design with the pink colored structure showcasing beautiful woodwork. The metallic round structures in the middle of the door are ring knockers and a devli can be spotted on the left of this door. The doors utilize a traditional chain (‘Kadi’) locking system. The wooden panel doors are approximately 6 ft. tall. Different doors can be seen across the residential structure. The door at the entrance features a more decorative design with motifs. Another door at the entrance has a simple double door structure. This door with a distinctive design is situated at the ancillary space of the house. The windows of the home feature iron grills set in wooden frames, with solid wood panel panes. The front-facing windows have devli’s on both sides for festival lighting. The windows are set within niches topped with curved arches and stone embellishments. Front-facing windows framed by devlis for festival lighting, set within arched niches which have stone details. Windows with wooden frames and iron grills, fitted with solid wood panel panes. Some windows have mosquito mesh in their upper sections for ventilation. The ground floor includes small clerestory windows for air circulation. Three traditional windows which can be found across different corners of the house. This window reveals a weathered wooden design with horizontal planks set in a stone wall. A two-panel window with green panes in a worn wooden frame. The netted panel may be a more recent feature, added for ventilation. A distinct small window with vertical bars. The exterior railings of the residential structure consist of cast iron panels within wooden frameworks, while the interior courtyard railings are simpler metal rods in wooden frames. Both maintain a rustic finish. The interior railings include a top wooden section with square openings for ventilation. Exterior view of a historic residence in Ahilyanagar showing decorative balcony railings and arched openings on the upper floor. Interior courtyard perspective showing the levels of the building alongside metal railings and other structural elements. The roof is supported by a wooden framework covered with metal sheets and Mangalore tiles. The roofing structure of the residential space. The roofing is covered with metal sheets and mangalore tiles. As mentioned above, this house has a very distinctive architectural character. Perhaps this is because there are several notable elements within it that reveal a pattern of regional design practices and contribute to both its structural and cultural significance. One such feature is a small, old iron bridge on the first floor. A simple metal bridge connecting areas on the first floor. Another fascinating element which can be found in the house is an underground passage, locally referred to as “Balad.” According to residents, these tunnels were once common in homes across Khist Galli and were originally built as hidden refuge spaces during times of conflict. Though now sealed, they remain an important part of the area’s architectural history. The sealed entrance to the underground tunnel (Balad), a historical security feature found in many homes of this area. A Late-20th Century Residence at the Gulmohar Road of Savedi Gulmohar Road in Savedi is a locality where residential spaces began to develop extensively in the late 20th and early 21st centuries. During this period, a housing society called the Mangal Housing Society was formed which featured a cluster of similar-looking residences. Among these residences, Devashish stands as a notable bungalow, constructed in 1993. Remarkably, it is said to be the first bungalow of the Mangal Housing Society. The Devashish Bungalow which lies on the Gulmohar Road of Savedi. As the first house in the housing society, Devashish plays a defining role in the layout of the area. The arrangement of homes follows a structured pattern, with this bungalow positioned at the entrance of the housing society. One can find several distinct architectural features within the bungalow, which align very much with contemporary architectural trends and practices. Balusters (short, vertical decorative columns) are prominently used in the balcony railing, terrace parapet, and external enclosure wall, adding a decorative yet functional element to the design. The exterior also features a contrasting paint scheme and a curved structural form, making it visually striking. Balusters on the railings of the exterior enclosure. Balusters on the railings of the balcony and terrace, along with the contrasting paint design. All doors in the bungalow are uniformly crafted from teak wood, featuring decorative brass handles and traditional ‘Kadi’ locking systems. For added security, the main entrance is reinforced with an external mild steel grill door. While the main door has a polished finish, the interior doors have painted finishes that match the overall design. The teak wood main door with brass handles and an external mild steel grill door for security. The interior door has a similar finish to the entrance door of the house. The windows throughout the residence maintain a consistent design, featuring geometric patterned iron grills mounted externally. Each window is framed with teak (Sagwan) wood and fitted with glass panels. Uniformly designed windows with teak wood frames and fitted with glass panels. The windows have an iron grill enclosure on the exterior. The residence features two landscaped garden areas, one situated adjacent to the main entrance and another in the rear yard. The garden which is located at the entrance of the bungalow. Garden at the backyard of the bungalow. Various contemporary landscape design elements can be found throughout the residence. There are exposed concrete slabs that define the walkways of the residence and interlocking tiles in yellow which can be seen at the garden which lies at the entrance. In the backyard garden, an arrangement of flower pots suggests the homeowner’s keen interest in horticulture, adding a personalized touch to the green space. A Residential Building at Shrigonda Bypass As time passes, one can usually see how new architectural styles gradually begin to reshape the region’s landscape. In Shrigonda Bypass, a locality often described as a “developing area,” this transition is evident. Over the 21st century, mid-rise buildings have increasingly become part of the locality’s built environment (a technical term for the human-made surroundings that make up a community). Among them is a four-storey residential apartment building, whose construction was completed in 2019. Exterior view of a four-storey residential building at Shrigonda Bypass. The building’s design significantly differs from older homes of the district. It features a larger scale and a relatively more contemporary architectural approach which can typically be seen across many semi-urban and urban regions of Maharashtra. A street view of a developing urban area featuring several multi-storey buildings along an unpaved road. A closer view of the residential building which has an interesting modular color panel design. The building appears to use contrasting rectangular sections of ochre/yellow and white that create a visual rhythm across the facade. The composite structure of the building very much aligns with the mainstream practices of the current day. It uses reinforced cement concrete (RCC) with steel and cement for the main framework. Its walls are made of brick, while the floors have steel frameworks filled with concrete and covered with tiles. The main entrance has a mild steel grill door outside the porch area. The inside doors are flush doors with veneer and polish. Entrance area showing a gray metal security door with grills and narrow corridor. Interior view of a dark-colored flush door within a living space, featuring white walls and wooden flooring. The windows have mild steel grills with a simple pattern which is called the “Bombay design.” The windows slide open and have aluminum frames with glass panels. The windows have aluminum frames with glass panels that slide open for ventilation. The windows are fitted with mild steel grills featuring what is called a ‘Bombay design.’ The balconies have box-shaped grills made of mild steel. Metal and glass are materials that have been commonly used in the windows and railings of the home. All of the features, all in all, showcase how the ‘residential spaces’ of this era have been reimagined so differently from the houses of the 19th and 20th century. Sources Government of India. Ahmednagar: Ahmednagar Fort. Maharashtra Tourism. https://maharashtratourism.gov.in/fort/ahmed… M Singh and S Vinodh Kumar. 2019. Architechtural features and characterization of 16th century Indian Monument Farah Bagh, Ahmed Nagar, India. International Journal of Architectural Heritage. https://www.researchgate.net/publication/332… Shree Datta Devasthan Trust. Shree Datta Kshetra. Shree Datta Devasthan Trust. https://dattadevasthan.org/shree-datta-kshet… Tour My India. Bagh Rauza Ahmednagar. Tour My India. https://www.tourmyindia.com/states/maharasht… Tour My India. Salabat Khan Tomb Ahmednagar. Tour My India. https://www.tourmyindia.com/states/maharasht… Last updated on 6 November 2025. Help us improve the information on this page by clicking on suggest edits or writing to us. Contents Architecture of Prominent Sites Dhokeshwar Cave, Takli Ahmednagar Fort Bagh Rauza Farah Baksh Mahal Salabat Khan’s Tomb Vishal Ganpati Mandir Hume Memorial Church Shri Datta Mandir Residential Architecture A late 19th Century Residence at Shimpi Galli A 20th Century Residence at Khist Galli A Late-20th Century Residence at the Gulmohar Road of Savedi A Residential Building at Shrigonda Bypass Sources",
      "links": [
        "https://indiandistricts.in/",
        "https://indiandistricts.in/maharashtra/",
        "https://indiandistricts.in/maharashtra/ahilyanagar/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/akola/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/amravati/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/beed/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/bhandara/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/buldhana/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/chandrapur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/chhatrapati-sambhaji-nagar/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/dharashiv/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/dhule/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/gadchiroli/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/gondia/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/hingoli/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/jalgaon/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/jalna/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/kolhapur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/latur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/mumbai/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/mumbai-suburban/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/nagpur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/nanded/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/nandurbar/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/nashik/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/palghar/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/parbhani/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/pune/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/raigad/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/ratnagiri/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/sangli/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/satara/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/sindhudurg/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/solapur/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/thane/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/wardha/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/washim/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/yavatmal/architecture/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/artforms/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/cultural-sites/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/festivals-fairs/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/food/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/political-history/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/language/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/markets/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/sports-games/",
        "https://indiandistricts.in/cultures/maharashtra/ahilyanagar/stories/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/agriculture/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/demography/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/education/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/local-politics/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/environment/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/health/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/industry/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/labour/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/livestock-fisheries/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/police-judiciary/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/revenue-expenditure/",
        "https://indiandistricts.in/statistics/maharashtra/ahilyanagar/transport-communication/",
        "https://indiandistricts.in/editor/culture/suggest_edit/131/",
        "https://indiandistricts.in/footersection/leave-us-a-message/",
        "https://commons.wikimedia.org/wiki/File:View_of_sanctum_with_Dwarapalakas_on_either_side.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Ahmednagar_Fort_Main_Gate.jpg/1280px-Ahmednagar_Fort_Main_Gate.jpg",
        "https://commons.wikimedia.org/wiki/File:Tomb_of_Ahmed_Nizam_Shah.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Faria_Bagh_Palace_of_second_Nizam.JPG/1280px-Faria_Bagh_Palace_of_second_Nizam.JPG",
        "https://commons.wikimedia.org/wiki/File:Salabat_Khan%27s_tomb_2.jpg",
        "https://maharashtratourism.gov.in/fort/ahmednagar/",
        "https://www.researchgate.net/publication/332935786_Architechtural_features_and_characterization_of_16th_century_Indian_Monument_Farah_Bagh_Ahmed_Nagar_India",
        "https://dattadevasthan.org/shree-datta-kshetra.html",
        "https://www.tourmyindia.com/states/maharashtra/bagh-rauza-ahmednagar.html",
        "https://www.tourmyindia.com/states/maharashtra/salabat-khan-tomb-ahmednagar.html"
      ],
      "images": [
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-takli-dhokeshwar-cave-is-a-rock-_d1jion8.jpg",
          "alt": "The Takli Dhokeshwar Cave is a rock-cut mandir, reached by climbing a long flight of stairs up the hill. (Source: CKA Archive)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-garbhagriha-houses-a-square-ling_IZb7VgV.png",
          "alt": "The garbhagriha houses a square linga pitha, surrounded by a dark circumambulatory path, with guardian Dvarapalas flanking its entrance.[1]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/ahmednagar-fort-an-oval-shaped-bhuik_8qan7Hp.png",
          "alt": "Ahmednagar Fort, an oval-shaped Bhuikot (ground) fort, features thick stone walls and 24 bastions.[2]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/bagh-rauza-is-an-indo-islamic-tomb-c_kfftiBQ.png",
          "alt": "Bagh Rauza is an Indo-Islamic tomb complex with a black basalt stone mausoleum featuring a white-plastered dome, enclosed within high boundary walls.[3]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/farah-baksh-mahal-is-a-two-storey-in_dCOkXEy.png",
          "alt": "Farah Baksh Mahal is a two-storey Indo-Islamic water palace built from basalt stone, with thick lime plaster blending stone, pottery, and natural fibers.[4]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-interior-of-farah-baksh-mahal-fe_Vj7cRrs.jpg",
          "alt": "The interior of Farah Baksh Mahal features recessed niches, carved teakwood lintels, and traces of stucco work. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/salabat-khans-tomb-is-an-octagonal-t_XllujWD.png",
          "alt": "Salabat Khan’s Tomb is an octagonal, three-storeyed stone structure in the Indo-Islamic style.[5]"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-vishal-ganpati-mandir-built-in-t_06pUyxp.jpg",
          "alt": "The Vishal Ganpati Mandir, built in the traditional Maratha architectural style, features ornate arched windows, finely carved stone panels, and a domed shikhara. Reconstructed using Makrana marble, it has a striking white exterior. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-hume-memorial-church-inspired-by_oytQdnZ.jpg",
          "alt": "The Hume Memorial Church, inspired by Gothic Revival architecture, is built from locally sourced stone. It features a pitched roof with a wooden truss system and beautiful stained-glass windows. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/shri-datta-mandir-built-from-gulabi-_T9GqhA0.jpg",
          "alt": "Shri Datta Mandir, built from Gulabi Bansi Paharpur Dagad, follows the modern Navaratna mandir style. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-sculptural-panel-depicting-bhagwan_Hkvmgi9.jpg",
          "alt": "A sculptural panel depicting Bhagwan Hanuman with the Vanar Sena constructing the stone bridge to Lanka, capturing a key moment from the Ramayan in intricate stone carving. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-residential-structure-situated-at-_grnAjY7.jpg",
          "alt": "A residential structure situated at the Shimpi Galli which is said to have been built in the 1880s. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-old-residential-structures-and-t_110XgPc.jpg",
          "alt": "The old residential structures and the intimate character of the lanes of Shimpi Galli. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-composite-structure-of-the-house_nhsfKrM.jpg",
          "alt": "The composite structure of the house shows distinct building materials on each floor—stone on the ground level and brick on the upper storey. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/similar-architectural-patterns-appea_K6WdZxS.jpg",
          "alt": "Similar architectural patterns appear in buildings throughout the area, where brick parapets contrast with stone foundations, each showcasing the unique masonry of a bygone era. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/main-entrance-with-yellow-painted-wo_Icjbe5q.jpg",
          "alt": "Main entrance with yellow-painted wooden panels and decorative elements. Above the door, a carved niche, distinct in color, is traditionally used to place an image or murti of a devi or devta with the belief that they will protect the home. A half-height railing is attached to the door as a safety barrier. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-blue-colored-door-which-matches-th_ommnLnS.jpg",
          "alt": "A blue-colored door which matches the shade of the beautiful decorative elements that adorn the second storey. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/traditional-gajachya-khidkya-windows_JPY7ev9.jpg",
          "alt": "Traditional “Gajachya khidkya” windows set within niches with rounded tops and contrasting colors. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-windows-have-horizontal-and-very_kczW9Ez.jpg",
          "alt": "The windows have horizontal and very symmetrical iron grills that are overshadowed by the metal mesh, which was likely added later. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/decorative-railings-with-wooden-corn_mfqtI9i.jpg",
          "alt": "Decorative railings with wooden cornice and metal elements found both in the interior and exterior of the house. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/decorative-railings-featuring-geomet_ExulFvQ.jpg",
          "alt": "Decorative railings featuring geometric and floral motifs. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-wooden-rafters-that-form-the-roo_k3BD46X.jpg",
          "alt": "The wooden rafters that form the roof structure. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-metal-sheet-roofing-in-the-court_6GXPceX.jpg",
          "alt": "The metal sheet roofing in the courtyard, which was likely a later addition. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-beautiful-and-unique-residence-whi_DhHO4lj.jpg",
          "alt": "A beautiful and unique residence which lies in the Khist Galli of Ahilyanagar City. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-residential-structure-which-stands_iegUxAs.jpg",
          "alt": "A residential structure which stands on the opposite side of the street. Interestingly, the two houses share a similar color scheme. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-view-of-both-residential-structure_nF3MTEO.jpg",
          "alt": "A view of both residential structures and the narrow road that passes in the middle. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-height-and-plinth-of-the-house-w_E60aib6.jpg",
          "alt": "The height and plinth of the house which stands in contrast against a human scale. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-balcony-projection-features-a-wo_47uPL9T.jpg",
          "alt": "The balcony projection features a wooden cantilever structure, visible beneath the unplastered, triangular parapet. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-front-entrance-of-the-house-sour_7MJqHiN.jpg",
          "alt": "The front entrance of the house. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-back-entrance-of-the-house-sourc_HZjQXX4.jpg",
          "alt": "The back entrance of the house. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-main-door-displays-decorative-fl_W7LRA6N.jpg",
          "alt": "The main door displays decorative floral carvings with metal studs. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-back-entrance-doors-of-the-house_XVe37q3.jpg",
          "alt": "The back entrance doors of the house are painted in pink and white cream shades. The door features many interesting architectural elements. It has a distinctive design with the pink colored structure showcasing beautiful woodwork. The metallic round structures in the middle of the door are ring knockers and a devli can be spotted on the left of this door. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/different-doors-can-be-seen-across-t_F0Rwd5O.jpg",
          "alt": "Different doors can be seen across the residential structure. The door at the entrance features a more decorative design with motifs. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/another-door-at-the-entrance-has-a-s_yBBslZi.jpg",
          "alt": "Another door at the entrance has a simple double door structure. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/this-door-with-a-distinctive-design-_dw3BsOd.jpg",
          "alt": "This door with a distinctive design is situated at the ancillary space of the house. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/front-facing-windows-framed-by-devli_aHxQP0P.jpg",
          "alt": "Front-facing windows framed by devlis for festival lighting, set within arched niches which have stone details. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/windows-with-wooden-frames-and-iron-_gpwcUYs.jpg",
          "alt": "Windows with wooden frames and iron grills, fitted with solid wood panel panes. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/three-traditional-windows-which-can-_RJtek40.jpg",
          "alt": "Three traditional windows which can be found across different corners of the house. This window reveals a weathered wooden design with horizontal planks set in a stone wall. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-two-panel-window-with-green-panes-_O31Tx7x.jpg",
          "alt": "A two-panel window with green panes in a worn wooden frame. The netted panel may be a more recent feature, added for ventilation. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-distinct-small-window-with-vertica_hWVNN6v.jpg",
          "alt": "A distinct small window with vertical bars. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/exterior-view-of-a-historic-residenc_e6lm7av.jpg",
          "alt": "Exterior view of a historic residence in Ahilyanagar showing decorative balcony railings and arched openings on the upper floor. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/interior-courtyard-perspective-showi_5w0T002.jpg",
          "alt": "Interior courtyard perspective showing the levels of the building alongside metal railings and other structural elements. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-roofing-structure-of-the-residen_dgitXFV.jpg",
          "alt": "The roofing structure of the residential space. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-roofing-is-covered-with-metal-sh_uTP0NPG.jpg",
          "alt": "The roofing is covered with metal sheets and mangalore tiles. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-simple-metal-bridge-connecting-are_w7orlrL.jpg",
          "alt": "A simple metal bridge connecting areas on the first floor. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-sealed-entrance-to-the-undergrou_eXainPX.jpg",
          "alt": "The sealed entrance to the underground tunnel (Balad), a historical security feature found in many homes of this area. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-devashish-bungalow-which-lies-on_CZyGE22.jpg",
          "alt": "The Devashish Bungalow which lies on the Gulmohar Road of Savedi. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/balusters-on-the-railings-of-the-ext_fBgLgBA.jpg",
          "alt": "Balusters on the railings of the exterior enclosure. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/balusters-on-the-railings-of-the-bal_ognI52R.jpg",
          "alt": "Balusters on the railings of the balcony and terrace, along with the contrasting paint design. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-teak-wood-main-door-with-brass-h_KemqsHE.jpg",
          "alt": "The teak wood main door with brass handles and an external mild steel grill door for security. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-interior-door-has-a-similar-fini_egjrt9b.jpg",
          "alt": "The interior door has a similar finish to the entrance door of the house. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/uniformly-designed-windows-with-teak_Hk6ZDJV.jpg",
          "alt": "Uniformly designed windows with teak wood frames and fitted with glass panels. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-windows-have-an-iron-grill-enclo_NnP6n2q.jpg",
          "alt": "The windows have an iron grill enclosure on the exterior. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-garden-which-is-located-at-the-e_kGIC1Pd.jpg",
          "alt": "The garden which is located at the entrance of the bungalow. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/garden-at-the-backyard-of-the-bungal_EPM4vyf.jpg",
          "alt": "Garden at the backyard of the bungalow. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/exterior-view-of-a-four-storey-resid_9XTy5aP.jpg",
          "alt": "Exterior view of a four-storey residential building at Shrigonda Bypass. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-street-view-of-a-developing-urban-_VLV3fYm.jpg",
          "alt": "A street view of a developing urban area featuring several multi-storey buildings along an unpaved road. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/a-closer-view-of-the-residential-bui_klDEgyw.jpg",
          "alt": "A closer view of the residential building which has an interesting modular color panel design. The building appears to use contrasting rectangular sections of ochre/yellow and white that create a visual rhythm across the facade. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/entrance-area-showing-a-gray-metal-s_wEtR01n.jpg",
          "alt": "Entrance area showing a gray metal security door with grills and narrow corridor. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/interior-view-of-a-dark-colored-flus_WvtBJX2.jpg",
          "alt": "Interior view of a dark-colored flush door within a living space, featuring white walls and wooden flooring. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-windows-have-aluminum-frames-wit_E2WylaO.jpg",
          "alt": "The windows have aluminum frames with glass panels that slide open for ventilation. (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-windows-are-fitted-with-mild-ste_e6BX4DP.jpg",
          "alt": "The windows are fitted with mild steel grills featuring what is called a ‘Bombay design.’ (Source: CKA Archives)"
        },
        {
          "src": "https://indiandistricts.in/media/culture/images/maharashtra/ahilyanagar/architecture/the-balconies-have-box-shaped-grills_KZ3rJdL.jpg",
          "alt": "The balconies have box-shaped grills made of mild steel. (Source: CKA Archives)"
        }
      ],
      "structuredData": {}
    }
  ]
}